#ifndef _AFXSTD_EFD0B66D_27F9_4178_9579_0A66D59E6348_INCLUDE_H_
#define _AFXSTD_EFD0B66D_27F9_4178_9579_0A66D59E6348_INCLUDE_H_

#if _MSC_VER >= 1200
#pragma once
#endif //!_MSC_VER >= 1200


//--------------------------------------------------------------------------
//								Sentinel Encrypt
//--------------------------------------------------------------------------
typedef class Ci_HKFY  *PCI_HKFY;
class CHKFY
{
public:
	CHKFY();
	~CHKFY();

public:
	//=================================GetErrorName()=================================
	/// @brief 获取错误码的名称
	///
	/// 获取LogIn、LogOut返回的错误码的名称
	///
	/// @param [in] errorCode 错误码
	///
	/// @return 返回错误码对应的中文描述
	//================================================================================
	const char *GetErrorName(int errorCode);
	//====================================LogIn()===================================
	/// @brief 登录
	///
	/// 根据功能的ID号，登录HL锁
	///
	/// @param [in] lFeatureId 功能ID号
	///
	///	|功能描述				|功能ID号				|使用层面				|
	///	|-------------------|-------------------|-------------------|
	///	|采集				|	11              |                   |
	///	|特效				|   6				|                   |
	///	|字幕				|	4				|                   |
	///	|图像				|	3				|                   |
	///	|序列				|	43              |                   |
	///	|编解码				|	2               |                   |
	///	|监视卡				|   15              |                   |
	///	|单音视频				|	7               |                   |
	///	|外挂				|   31              |                   |
	///	|UI采集				|   1               |                   |
	///	|UI回溯				|   8               |                   |
	///	|UI时间线				|	5               |                   |
	///	|UI界面exe           |	21              |                   |
	///
	/// @return 成功返回0
	//================================================================================
	int  LogIn(unsigned long lFeatureId);
	//====================================LogOut()====================================
	/// @brief 退出
	///
	/// 退出登录
	///
	/// @return 成功返回0
	///
	/// @remark 每次登录后，需要调用该函数退出登录
	//================================================================================
	int  LogOut();
	//===================================CheckRom()===================================
	/// @brief 检测只读内存
	///
	/// 对HL锁的只读内存的有效性进行检测
	///
	/// @return 成功返回0
	///
	/// @remark 整个应用程序只需要调用一次,使用指定的功能ID号单音视频(7)	
	//================================================================================
	int  CheckRom();
	//===================================CheckRam()===================================
	/// @brief 检测读写内存
	///
	/// 对HL锁的读写内存的有效性进行检测
	///
	/// @return 成功返回0
	///
	/// @remark 整个应用程序只需要调用一次,使用指定的功能ID号单音视频(7)	
	//================================================================================
	int  CheckRam();
	//=================================GetPointNum()================================
	/// @brief 获取采样的通道数
	///
	/// @return 返回实际的通道数 
	//================================================================================
	int  GetPointNum();

private:
	PCI_HKFY	m_pHKFY;
};


#endif //!_AFXSTD_5F8D5465_E219_4070_B0F1_5A3A0DD4CECD_INCLUDE_H_